cylinder_test/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    minX  // INLET
    {
        type            outletInlet;
        outletValue     uniform 0;
        value           uniform 0;
    }
    
    maxX  // OUTLET
    {
        type            outletInlet;
        outletValue     uniform 0;
        value           uniform 0;
    }
    
    minY  // BOTTOM - open boundary
    {
        type            outletInlet;
        outletValue     uniform 0;
        value           uniform 0;
    }
    
    maxY  // TOP - open boundary
    {
        type            outletInlet;
        outletValue     uniform 0;
        value           uniform 0;
    }
    
    minZ
    {
        type            empty;
    }
    
    maxZ
    {
        type            empty;
    }
    
    stlSurface  // AIRFOIL
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
