cylinder_test/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions
touch airFoil2D.foam
runApplication decomposePar
runParallel $(getApplication)
#runApplication reconstructPar

#------------------------------------------------------------------------------
