cylinder_test/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc forceCoeffsIncompressible
#includeFunc residuals(name=residuals, p)
// #includeFunc streamlinesLine
// (
//     name=streamlines,
//     start=(0.001 -0.002 0),
//     end=(0.001 0.002 0),
//     nPoints=40,
//     U
// )

// ************************************************************************* //
